Revit 2015 API
BoundarySegment.Document Property
Provides the document in which the element that created this segment resides.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public Document Document { get; }
Visual Basic
Public ReadOnly Property Document As Document
	Get
Visual C++
public:
property Document^ Document {
	Document^ get ();
}
See Also
BoundarySegment Class
Autodesk.Revit.DB Namespace